run/fsiFoam/3dTube/fluid/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    outlet
    {
        type            patch;
        nFaces          200;
        startFace       45800;
    }
    inlet
    {
        type            patch;
        nFaces          200;
        startFace       46000;
    }
    wall
    {
        type            wall;
        nFaces          1600;
        startFace       46200;
    }
    symmetry-x
    {
        type            symmetryPlane;
        nFaces          1200;
        startFace       47800;
    }
    symmetry-y
    {
        type            symmetryPlane;
        nFaces          1200;
        startFace       49000;
    }
)

// ************************************************************************* //
